In [1]:
# loading libraries

import numpy as np
import pandas as pd

### Reshaping and Pivoting

- Stack
- unstack

In [2]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
 .....: index=pd.Index(["Ohio", "Colorado"], name="state"),
 .....: columns=pd.Index(["one", "two", "three"],
 .....: name="number"))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [3]:
result = data.stack() #pivots the columns into the rows

In [4]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [5]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [6]:
result.unstack(level=0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [7]:
result.unstack(level='state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [8]:
s1 = pd.Series([0, 1, 2, 3], index=["a", "b", "c", "d"], dtype="Int64")
s2 = pd.Series([4, 5, 6], index=["c", "d", "e"], dtype="Int64")

In [9]:
data2 = pd.concat([s1,s2], keys=['one','two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [10]:
data2.unstack()

        a     b  c  d     e
one     0     1  2  3  <NA>
two  <NA>  <NA>  4  5     6

In [11]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [12]:
data2.unstack().stack(dropna=False)

one  a       0
     b       1
     c       2
     d       3
     e    <NA>
two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

In [13]:
df = pd.DataFrame({"left": result, "right": result + 5},
 .....: columns=pd.Index(["left", "right"], name="side"))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [14]:
df.unstack()

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [15]:
df.unstack(level='state')
#When you unstack in a DataFrame, the level unstacked becomes the lowest level in the result

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [16]:
df.unstack(level='state').stack(level='side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### Pivoting “Long” to “Wide” Format

In [17]:
data = pd.read_csv('macrodata.csv')
data

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959,1,2710.349,1707.4,286.898,470.045,1886.9,28.980,139.7,2.82,5.8,177.146,0.00,0.00
1,1959,2,2778.801,1733.7,310.859,481.301,1919.7,29.150,141.7,3.08,5.1,177.830,2.34,0.74
2,1959,3,2775.488,1751.8,289.226,491.260,1916.4,29.350,140.5,3.82,5.3,178.657,2.74,1.09
3,1959,4,2785.204,1753.7,299.356,484.052,1931.3,29.370,140.0,4.33,5.6,179.386,0.27,4.06
4,1960,1,2847.699,1770.5,331.722,462.199,1955.5,29.540,139.6,3.50,5.2,180.007,2.31,1.19
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,2008,3,13324.600,9267.7,1990.693,991.551,9838.3,216.889,1474.7,1.17,6.0,305.270,-3.16,4.33
199,2008,4,13141.920,9195.3,1857.661,1007.273,9920.4,212.174,1576.5,0.12,6.9,305.952,-8.79,8.91
200,2009,1,12925.410,9209.2,1558.494,996.287,9926.4,212.671,1592.8,0.22,8.1,306.547,0.94,-0.71
201,2009,2,12901.504,9189.0,1456.678,1023.528,10077.5,214.469,1653.6,0.18,9.2,307.226,3.37,-3.19
202,2009,3,12990.341,9256.0,1486.398,1044.088,10040.6,216.385,1673.9,0.12,9.6,308.013,3.56,-3.44

In [18]:
data = data.loc[:,['year', 'quarter', 'realgdp','infl','unemp']]
data

     year  quarter    realgdp  infl  unemp
0    1959        1   2710.349  0.00    5.8
1    1959        2   2778.801  2.34    5.1
2    1959        3   2775.488  2.74    5.3
3    1959        4   2785.204  0.27    5.6
4    1960        1   2847.699  2.31    5.2
..    ...      ...        ...   ...    ...
198  2008        3  13324.600 -3.16    6.0
199  2008        4  13141.920 -8.79    6.9
200  2009        1  12925.410  0.94    8.1
201  2009        2  12901.504  3.37    9.2
202  2009        3  12990.341  3.56    9.6

[203 rows x 5 columns]

In [19]:
period = pd.PeriodIndex(year = data.pop('year'), # Rep interval
                       quarter = data.pop('quarter'), 
                       name='date')
period

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203)

In [20]:
data.index = period.to_timestamp("D")
data.head()

             realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

In [21]:
data = data.reindex(columns=['realgdp', 'infl','unemp'])
data.columns.name = "item"

In [22]:
data.head()

item         realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

In [23]:
long_data= data.stack().reset_index().rename(columns={0:"value"})
long_data

          date     item      value
0   1959-01-01  realgdp   2710.349
1   1959-01-01     infl      0.000
2   1959-01-01    unemp      5.800
3   1959-04-01  realgdp   2778.801
4   1959-04-01     infl      2.340
..         ...      ...        ...
604 2009-04-01     infl      3.370
605 2009-04-01    unemp      9.200
606 2009-07-01  realgdp  12990.341
607 2009-07-01     infl      3.560
608 2009-07-01    unemp      9.600

[609 rows x 3 columns]

In [24]:
pivoted = long_data.pivot(index = 'date', columns='item', values='value')
pivoted

item        infl    realgdp  unemp
date
1959-01-01  0.00   2710.349    5.8
1959-04-01  2.34   2778.801    5.1
1959-07-01  2.74   2775.488    5.3
1959-10-01  0.27   2785.204    5.6
1960-01-01  2.31   2847.699    5.2
...          ...        ...    ...
2008-07-01 -3.16  13324.600    6.0
2008-10-01 -8.79  13141.920    6.9
2009-01-01  0.94  12925.410    8.1
2009-04-01  3.37  12901.504    9.2
2009-07-01  3.56  12990.341    9.6

[203 rows x 3 columns]

In [25]:
long_data['value2'] = np.random.standard_normal(len(long_data))
long_data

          date     item      value    value2
0   1959-01-01  realgdp   2710.349 -1.076743
1   1959-01-01     infl      0.000 -0.406074
2   1959-01-01    unemp      5.800 -0.259084
3   1959-04-01  realgdp   2778.801  0.321055
4   1959-04-01     infl      2.340 -1.106513
..         ...      ...        ...       ...
604 2009-04-01     infl      3.370  0.488967
605 2009-04-01    unemp      9.200  0.287530
606 2009-07-01  realgdp  12990.341  0.927203
607 2009-07-01     infl      3.560 -0.567866
608 2009-07-01    unemp      9.600  1.241478

[609 rows x 4 columns]

In [26]:
pivoted = long_data.pivot(index='date', columns='item')
pivoted

           value                     value2
item        infl    realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00   2710.349   5.8 -0.406074 -1.076743 -0.259084
1959-04-01  2.34   2778.801   5.1 -1.106513  0.321055  1.265547
1959-07-01  2.74   2775.488   5.3  0.003692  1.805427 -1.004581
1959-10-01  0.27   2785.204   5.6 -1.437372  0.331877  0.765075
1960-01-01  2.31   2847.699   5.2 -0.414454  0.879496 -0.375623
...          ...        ...   ...       ...       ...       ...
2008-07-01 -3.16  13324.600   6.0  1.016821 -2.123348 -0.031707
2008-10-01 -8.79  13141.920   6.9  1.119138 -0.389136 -0.371377
2009-01-01  0.94  12925.410   8.1  0.895089  0.000338 -0.020080
2009-04-01  3.37  12901.504   9.2  0.488967  0.080836  0.287530
2009-07-01  3.56  12990.341   9.6 -0.567866  0.927203  1.241478

[203 rows x 6 columns]

In [27]:
pivoted['value'].head()

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2

In [28]:
unstacked = long_data.set_index(['date','item']).unstack(level='item')

In [29]:
unstacked

           value                     value2
item        infl    realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00   2710.349   5.8 -0.406074 -1.076743 -0.259084
1959-04-01  2.34   2778.801   5.1 -1.106513  0.321055  1.265547
1959-07-01  2.74   2775.488   5.3  0.003692  1.805427 -1.004581
1959-10-01  0.27   2785.204   5.6 -1.437372  0.331877  0.765075
1960-01-01  2.31   2847.699   5.2 -0.414454  0.879496 -0.375623
...          ...        ...   ...       ...       ...       ...
2008-07-01 -3.16  13324.600   6.0  1.016821 -2.123348 -0.031707
2008-10-01 -8.79  13141.920   6.9  1.119138 -0.389136 -0.371377
2009-01-01  0.94  12925.410   8.1  0.895089  0.000338 -0.020080
2009-04-01  3.37  12901.504   9.2  0.488967  0.080836  0.287530
2009-07-01  3.56  12990.341   9.6 -0.567866  0.927203  1.241478

[203 rows x 6 columns]

### Pivoting “Wide” to “Long” Format

In [30]:
df = pd.DataFrame({"key": ["foo", "bar", "baz"],
 .....: "A": [1, 2, 3],
 .....: "B": [4, 5, 6],
 .....: "C": [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [32]:
melted = pd.melt(df, id_vars='key') # Inverse operation of pivot
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [34]:
reshaped = melted.pivot(index = 'key', columns='variable', values='value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [35]:
  reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [36]:
pd.melt(df, id_vars="key", value_vars=["A", "B"])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [37]:
 pd.melt(df, value_vars=["A", "B", "C"])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [38]:
pd.melt(df, value_vars=["key", "A", "B"])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6